---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCProfileWithFold
source: html/6897e14d-07ed-1725-74b9-c36d71ff2d3b.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCProfileWithFold

Defines parameters for C Profile with fold structural section.

## Syntax (C#)
```csharp
public class StructuralSectionCProfileWithFold : StructuralSectionGeneralCEx
```